const express = require('express');
const cors = require('cors');
const { MongoClient } = require("mongodb");

const app = express();

const port = 3001;
const uri = "mongodb://localhost:27017";


const client = new MongoClient(uri);

async function getQuestion(id) {
  let question;
  try {
    // Connect the client to the server
    await client.connect();
    console.log("connected");
    const db =  client.db("test");
    const questions =  db.collection("questions");
    question = await questions.findOne({_id:id});
    console.log(question+""+id);
    
  } finally {
    await client.close();
  }
  return question;
}

async function getReviews()
{
  let reviews=[];
 
  try{
    await client.connect();
    console.log("connected");
    const db = client.db("test");
    const colReviews = db.collection("reviews");
    let cursor = colReviews.find();
    await cursor.forEach((doc)=>{
      console.log(doc);
      reviews.push(doc);});
    console.log(reviews);
  }
  finally{
    await client.close();
  }
  return reviews;
}

var brain = require('brain.js');
var net = new brain.NeuralNetwork();

let country={
        '0': 'Европа - (Великобританія, Франція, Хорватія, Польща, Угорщина, Німеччина, Словенія, Чехія) – справжній рай для вас. Поєднання високого рівня життя та унікальної історії підходить для поціновувачів європейської культури. Ці країни відрізняються особливим колоритом та багатовіковою історією, яку можна спостерігати прямо на вулицях міст. Центральна Європа підходить для тих, хто цінує європейський підхід до життя та стабільності.',
        '1': 'Америка - культура цієї країни тісно переплетена з європейською, але має власний колорит, чим і приваблює туристів. У кожен може знайти містечко собі до душі - від безкрайніх каньйонів до величезних хмарочосів. Природа США, як та її культура, різноманітна і незвичайна. А високий рівень життя робить цю країну однією з найбажаніших для переїзду!',
        '2': 'Північ - (Ірландія, Фінляндія, Данія, Швеція, Норвегія, Ісландія, Канада). Ці країни прекрасні своєю нордичною красою! Вони чудово підійдуть для тих, хто любить гори, ліси, чисті річки та озера. Крім того, більшість країн Північної Європи входять до ТОП з екології, рівня та тривалості життя. Звичайно, тут немає шуму мегаполісів, зате є природа, недоторкана людиною та прості радості життя.',
        '3': 'Південь - (Туреччина, Греція, Італія, Монако, Чорногорія, Іспанія) підійдуть для вашого переїзду! Ці країни відрізняються від центральної Європи своїм укладом життя та традиціями та підійдуть для тих, хто любить середземноморський клімат. Унікальна кухня, розмірений темп життя та близькість до моря робить ці країни ідеальними для того, хто хоче відпочити та розслабитись.',
        '4': 'Азія - ось ваш справжній будинок. Там ви почуватиметеся комфортно та затишно! Китай і Японію не переплутати з іншими країнами - вони мають унікальний колорит. Жителям цих держав вдалося зберегти свої дивовижні традиції протягом кількох тисячоліть. При цьому багато країн Азії вміло поєднали свою історію та високі технології. На вулицях мегаполісів можна легко зустріти як гейш у національних костюмах, так і офісних працівників!',
        '5': 'Азія - ось ваш справжній будинок. Там ви почуватиметеся комфортно та затишно! Китай і Японію не переплутати з іншими країнами - вони мають унікальний колорит. Жителям цих держав вдалося зберегти свої дивовижні традиції протягом кількох тисячоліть. При цьому багато країн Азії вміло поєднали свою історію та високі технології. На вулицях мегаполісів можна легко зустріти як гейш у національних костюмах, так і офісних працівників!'
};

net.train([{input: [5,2,5,4,2,4,1,2,5,5,1,5], output: [0.0]},
           {input: [1,2,3,4,1,3,4,5,2,2,3,5], output: [0.1]},
           {input: [4,4,2,3,4,5,4,1,2,1,2,2], output: [0.1]},
           {input: [2,2,3,5,1,2,4,3,4,4,1,1], output: [0.2]},
           {input: [2,3,4,4,5,5,2,2,3,2,3,5], output: [0.3]},
           {input: [1,2,2,2,4,2,3,3,1,2,4,3], output: [0.2]},
           {input: [3,4,2,3,2,2,3,3,5,5,5,5], output: [0.2]},
           {input: [4,3,1,2,5,3,4,4,3,3,2,5], output: [0.4]},
           {input: [1,5,3,3,4,2,3,1,1,1,4,4], output: [0.1]},
           {input: [1,5,3,5,4,5,5,4,1,1,2,2], output: [0.1]},
           {input: [2,3,1,3,5,1,4,5,3,4,3,3], output: [0.4]},
           {input: [4,2,1,5,2,3,4,5,4,5,1,2], output: [0.0]},
           {input: [1,3,2,3,2,5,3,2,1,2,4,4], output: [0.0]},     
           {input: [2,2,2,4,3,1,3,4,5,1,2,2], output: [0.2]},
           {input: [1,1,1,1,1,1,1,1,1,1,1,1], output: [0.1]},
           {input: [2,2,2,2,2,2,2,2,2,2,2,2], output: [0.2]},
           {input: [3,3,3,3,3,3,3,3,3,3,3,3], output: [0.4]},
           {input: [3,1,5,2,2,3,3,4,5,5,3,5], output: [0.2]},
           {input: [4,4,4,4,4,4,4,4,4,4,4,4], output: [0.3]},
           {input: [5,5,5,5,5,5,5,5,5,5,5,5], output: [0.1]},
           {input: [5,1,3,4,4,2,2,3,1,1,2,4], output: [0.3]},
           {input: [3,2,4,4,2,2,1,1,1,2,4,4], output: [0.3]},
           {input: [2,3,2,5,3,4,2,2,5,2,3,3], output: [0.4]},
           {input: [4,2,1,2,3,4,2,2,3,4,1,2], output: [0.0]},
           {input: [3,4,2,2,1,1,5,4,2,3,3,3], output: [0.2]},
           {input: [4,2,4,2,3,5,2,2,1,1,1,1], output: [0.2]},
           {input: [4,4,2,5,2,1,3,1,5,3,2,1], output: [0.2]},
           {input: [3,2,3,1,2,3,4,4,5,5,3,2], output: [0.0]},
           {input: [1,1,2,3,3,3,5,2,1,2,1,2], output: [0.2]},
           {input: [2,2,2,4,4,4,5,5,5,1,2,3], output: [0.0]},
           {input: [3,5,4,2,1,3,2,3,4,1,2,5], output: [0.1]},
           {input: [4,3,2,1,5,5,1,2,2,3,4,2], output: [0.0]},
           {input: [2,2,1,4,3,2,2,1,5,4,4,2], output: [0.3]},
           {input: [1,1,1,5,4,3,2,1,1,4,3,5], output: [0.1]},
           {input: [1,2,3,5,2,4,5,4,3,2,1,5], output: [0.1]},
           {input: [4,2,3,1,4,5,1,4,2,2,4,1], output: [0.3]},
           {input: [2,1,4,5,5,3,2,2,1,4,3,3], output: [0.4]},
           {input: [4,3,4,2,2,1,3,3,4,4,4,1], output: [0.2]},
           {input: [2,2,3,5,1,3,4,5,4,5,4,1], output: [0.2]},
           {input: [1,2,3,4,1,2,3,3,3,2,1,1], output: [0.2]},
           {input: [4,3,2,1,1,1,5,5,4,4,3,4], output: [0.4]},
           {input: [2,1,1,4,4,5,3,3,5,1,2,2], output: [0.2]},
           {input: [1,5,5,4,3,5,3,5,1,4,3,4], output: [0.1]},
           {input: [3,3,2,4,5,5,2,2,1,4,4,4], output: [0.3]},
           {input: [2,2,3,5,5,1,2,2,3,1,5,2], output: [0.0]},
           {input: [1,1,4,2,3,2,4,3,5,3,3,5], output: [0.2]},
           {input: [2,2,1,4,4,3,5,4,1,2,3,4], output: [0.3]},
           {input: [5,1,5,2,3,1,2,4,5,2,3,3], output: [0.3]},
           {input: [5,5,2,2,2,1,1,5,4,2,3,3], output: [0.4]},
           {input: [3,4,5,2,3,2,1,5,1,2,2,5], output: [0.2]},
           {input: [1,1,4,2,2,3,4,4,4,5,2,1], output: [0.2]},
           {input: [1,2,1,2,2,3,4,5,3,5,4,5], output: [0.4]},
           {input: [2,2,5,4,3,4,2,1,5,3,1,1], output: [0.0]},
           {input: [5,4,3,2,1,3,3,4,4,5,1,5], output: [0.2]},
           {input: [4,4,3,2,2,5,2,4,5,2,3,4], output: [0.3]},
           {input: [1,5,2,3,3,4,2,2,1,5,5,1], output: [0.2]},
           

            ], {errorThresh: 0.0001, learningRate: 0.01,});


app.use(cors());

app.get('/question', async (req, res) => {
  let data = await getQuestion(Number(req.query.id));
  res.send(data);
});

app.get('/result',(req,res)=>{
  var output = net.run(req.query.answers);
  console.log(country[Math.round(output*10)] );
  res.send(country[Math.round(net.run(req.query.answers)*10)]);
});

app.get("/reviews",async(req,res)=>{
    let data = await getReviews();
    res.send(data);
});

app.listen(port, () => {
  console.log(`listening on port ${port}`)
});